In [3]:
import pandas as pd

Concat: Vertical & Horizontal

Vertical Concat or Union

In [22]:
# Dummy data Frames

df1 = pd.DataFrame({
        'A':['a0','a1','a2','a3'],
        'B':['b0','b1','b2','b3']
    },index=[0,1,2,3]) 
df2 = pd.DataFrame({
        'A':['a4','a5','a2','a3'],
        'B':['b4','b5','b2','b3']
    },index=[4,5,2,3])

In [23]:
pd.concat([df1,df2])

    A   B
0  a0  b0
1  a1  b1
2  a2  b2
3  a3  b3
4  a4  b4
5  a5  b5
2  a2  b2
3  a3  b3

In [26]:
df3 = pd.concat([df1,df2],keys=['df1','df2'])

In [34]:
df3.loc['df2']

    A   B
4  a4  b4
5  a5  b5
2  a2  b2
3  a3  b3

Horizontal Concat

In [38]:
pd.concat([df1,df2],axis=1,join='outer')

     A    B    A    B
0   a0   b0  NaN  NaN
1   a1   b1  NaN  NaN
2   a2   b2   a2   b2
3   a3   b3   a3   b3
4  NaN  NaN   a4   b4
5  NaN  NaN   a5   b5

In [39]:
pd.concat([df1,df2],axis=1,join='inner')

    A   B   A   B
2  a2  b2  a2  b2
3  a3  b3  a3  b3

Merge, Equivalent to join

In [42]:
pd.merge(df1,df2,on='A')

    A B_x B_y
0  a2  b2  b2
1  a3  b3  b3

In [43]:
pd.merge(df1,df2,on='A',how='left')

    A B_x  B_y
0  a0  b0  NaN
1  a1  b1  NaN
2  a2  b2   b2
3  a3  b3   b3

In [45]:
pd.merge(df1,df2,on='A',how='outer')

    A  B_x  B_y
0  a0   b0  NaN
1  a1   b1  NaN
2  a2   b2   b2
3  a3   b3   b3
4  a4  NaN   b4
5  a5  NaN   b5